import {
  Accordion,
  AccordionSummary,
  AccordionDetails,
  Typography
} from '@mui/material';
import { MdKeyboardArrowDown } from 'react-icons/md';
import { useTheme } from '../../context/ThemeContext.jsx';
import scss from './PrivacyPolicy.module.scss';

const PrivacyPolicy = () => {
  const sections = [
    {
      title: '1. Збір інформації',
      content: (
        <>
          <p className={scss.text}>
            1.1 Ми збираємо особисту інформацію, яку ви надаєте під час
            реєстрації та використання платформи. Це може включати: ім'я,
            прізвище, email, номер телефону тощо.
          </p>
          <p className={scss.text}>
            1.2 Ми також можемо отримувати автоматично зібрані дані, такі як
            IP-адреса, тип пристрою, операційна система, браузер тощо.
          </p>
        </>
      )
    },
    {
      title: '2. Використання інформації',
      content: (
        <>
          <p className={scss.text}>
            2.1 Ваші дані використовуються для надання послуг та
            функціональності платформи, зокрема обробки запитів користувачів,
            комунікації з вами, зокрема для відповіді на ваші запитання та
            надання підтримки, поліпшення користувацького досвіду шляхом аналізу
            поведінки користувачів та вдосконалення наших сервісів, надсилання
            важливих повідомлень, новин, оновлень і рекламних матеріалів, за
            умови отримання вашої згоди, виконання вимог законодавства, а також
            захисту прав та законних інтересів PlatzUA.
          </p>
        </>
      )
    },
    {
      title: '3. Захист даних',
      content: (
        <>
          <p className={scss.text}>
            3.1 Ми вживаємо всіх необхідних технічних та організаційних заходів
            для захисту ваших даних від несанкціонованого доступу, втрати або
            знищення. Ми використовуємо шифрування для захисту даних під час
            передачі через Інтернет, застосовуємо засоби контролю доступу, щоб
            лише авторизовані особи могли отримати доступ до ваших даних,
            регулярно проводимо аудит наших систем безпеки для виявлення та
            усунення потенційних уразливостей. Всі дії здійснюються відповідно
            до вимог GDPR та національного законодавства України для
            забезпечення безпеки ваших персональних даних.
          </p>
        </>
      )
    },
    {
      title: '4. Передача даних третім особам',
      content: (
        <>
          <p className={scss.text}>
            4.1 Дані можуть бути передані третім особам лише за вашою згодою або
            в межах необхідності для виконання наших зобов’язань. Зокрема, ми
            можемо передавати дані постачальникам послуг, які допомагають у
            підтримці та функціонуванні платформи PlatzUA (наприклад,
            постачальникам хостингу, аналітичним компаніям), відповідним
            державним органам у випадках, передбачених законодавством
            (наприклад, у відповідь на судовий запит), у випадку злиття, продажу
            або іншого переходу прав на активи PlatzUA, за умови, що передача
            даних буде регулюватися політикою конфіденційності.
          </p>
        </>
      )
    },
    {
      title: '5. Ваші права',
      content: (
        <>
          <p className={scss.text}>
            5.1 Ви можете отримати підтвердження про те, чи обробляються ваші
            персональні дані, а також запитати копію таких даних. Ви маєте право
            на виправлення неточних або неповних даних. Ви можете вимагати
            видалення ваших даних у випадках, коли вони більше не потрібні для
            цілей обробки. Ви можете вимагати обмеження обробки ваших даних за
            певних умов (наприклад, коли ви сумніваєтеся в тому, що дані є
            точними). Ви можете отримати свої дані в структурованому,
            загальновживаному та машинозчитувальному форматі. Ви можете
            заперечити проти обробки ваших даних у деяких випадках, наприклад,
            для маркетингових цілей.
          </p>
        </>
      )
    },
    {
      title: '6. Зміни до цієї політики',
      content: (
        <>
          <p className={scss.text}>
            6.1 Ми можемо час від часу оновлювати цю політику конфіденційності.
            Нова редакція вступає в силу з моменту її розміщення. Всі оновлення
            будуть опубліковані на цій сторінці, і ми повідомимо вас про
            будь-які суттєві зміни через електронну пошту або через повідомлення
            на платформі.
          </p>
          <p className={scss.text}>
            6.2 Якщо ви не погоджуєтеся зі змінами, ви зобов'язані припинити
            використання сервісів PlatzUA. Будь ласка, періодично перевіряйте цю
            сторінку для отримання актуальної інформації про нашу політику
            конфіденційності. Продовження використання платформи підтверджує
            вашу згоду з новою редакцією політики.
          </p>
        </>
      )
    },

    {
      title: '7. Використання куків',
      content: (
        <>
          <p className={scss.text}>
            7.1 Наш веб-сайт використовує куки для покращення користувацького
            досвіду, аналізу використання платформи та для рекламних цілей.
            Cookies — це невеликі текстові файли, які веб-сайт передає вашому
            браузеру під час відвідування. Вони зберігають інформацію, яка
            допомагає сайту запам'ятати ваші вподобання, щоб наступні
            відвідування були зручнішими, а контент — більш релевантним. Окрім
            cookies, можуть використовуватися інші схожі технології, такі як
            унікальні ідентифікатори для визначення пристрою чи додатка,
            піксельні теги або локальне сховище.
          </p>
          <p className={scss.text}>
            7.2 Ви можете контролювати куки через налаштування вашого браузера.
            Ви можете приймати або відхиляти куки, але це може вплинути на вашу
            здатність користуватися деякими функціями нашої платформи.
          </p>
        </>
      )
    },
    {
      title: '8. Контакти',
      content: (
        <>
          <p className={scss.text}>
            8.1 Якщо у вас виникли запитання або побажання щодо цієї політики
            конфіденційності, будь ласка, зв'яжіться з нами за допомогою форми
            зворотного зв'язку.
          </p>
        </>
      )
    }
  ];

  const { isDarkMode } = useTheme();

  return (
    <div className={scss.privacyContainer}>
      <h4>Політика конфіденційності</h4>
      <div className={scss.privacyContent}>
        <div>
          <p className={scss.infoText}>
            Ця політика конфіденційності пояснює, як ми збираємо,
            використовуємо, зберігаємо та захищаємо ваші персональні дані під
            час користування платформою PlatzUA. Ваше право на конфіденційність
            та захист особистої інформації є для нас пріоритетом, тому ми
            прагнемо забезпечити вас прозорою інформацією про наші процедури
            обробки даних.
          </p>
        </div>
        <div className={scss.menuInfo}>
          {sections.map((section, index) => (
            <Accordion
              key={index}
              className={`${scss.accordion} ${isDarkMode ? scss.darkMode : ''}`}
            >
              <AccordionSummary
                className={scss.info}
                expandIcon={
                  <MdKeyboardArrowDown
                    className={`${scss.icon} ${isDarkMode ? scss.darkMode : ''}`}
                  />
                }
                aria-controls={`panel${index}-content`}
                id={`panel${index}-header`}
              >
                <Typography variant="h7">{section.title}</Typography>
              </AccordionSummary>
              <AccordionDetails>
                <Typography variant="body3">{section.content}</Typography>
              </AccordionDetails>
            </Accordion>
          ))}
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
