import scss from './TermsOfService.module.scss';

const TermsOfService = () => {
  return (
    <div>
      <ul className={scss.TermsContainer}>
        <li>
          <h2>Умови використання</h2>
          <p className={scss.text}>
            Ці Умови використання регулюють ваше використання платформи PlatzUA.
            Використовуючи нашу платформу, ви погоджуєтеся дотримуватися цих
            умов. Якщо ви не згодні з цими умовами, будь ласка, не
            використовуйте нашу платформу.
          </p>
        </li>
        <li>
          <h3>1. Використання платформи</h3>
          <p className={scss.text}>
            1.1 Ви погоджуєтеся використовувати платформу лише в законних цілях.
            Забороняється використовувати платформу для будь-якої діяльності,
            яка може завдати шкоди або порушити права інших осіб.
          </p>
          <p className={scss.text}>
            1.2 Ви не повинні намагатися отримати несанкціонований доступ до
            системи або мережі платформи, а також використовувати будь-які
            методи для обходу заходів безпеки.
          </p>
        </li>
        <li>
          <h3>2. Користувацькі облікові записи</h3>
          <p className={scss.text}>
            2.1 Для доступу до певних функцій платформи вам може знадобитися
            створити обліковий запис. Ви несете відповідальність за
            конфіденційність вашого облікового запису і пароля.
          </p>
          <p className={scss.text}>
            2.2 Ви погоджуєтеся повідомляти нас про будь-які несанкціоновані
            використання вашого облікового запису або інші порушення безпеки.
          </p>
        </li>
        <li>
          <h3>3. Інтелектуальна власність</h3>
          <p className={scss.text}>
            3.1 Всі матеріали, представлені на платформі, включаючи текст,
            зображення, логотипи та програмне забезпечення, є власністю PlatzUA
            або третіх осіб і захищені відповідними законами про інтелектуальну
            власність.
          </p>
          <p className={scss.text}>
            3.2 Ви не маєте права копіювати, змінювати, розповсюджувати або
            іншим чином використовувати матеріали без попередньої письмової
            згоди відповідного власника.
          </p>
        </li>
        <li>
          <h3>4. Відповідальність</h3>
          <p className={scss.text}>
            4.1 Ви розумієте, що використовуєте платформу на свій ризик. PlatzUA
            не несе відповідальності за будь-які збитки, які можуть виникнути в
            результаті використання платформи або неможливості її використання.
          </p>
        </li>
        <li>
          <h3>5. Зміни до умов</h3>
          <p className={scss.text}>
            5.1 PlatzUA залишає за собою право вносити зміни до цих Умов
            використання. Всі зміни будуть опубліковані на цій сторінці, і ми
            повідомимо вас про будь-які суттєві зміни через електронну пошту або
            через повідомлення на платформі.
          </p>
          <p className={scss.text}>
            5.2 Ваше продовження використання платформи після внесення змін
            підтверджує вашу згоду з новими умовами.
          </p>
        </li>
        <li>
          <h3>6. Контактна інформація</h3>
          <p className={scss.text}>
            6.1 Якщо у вас є запитання або коментарі щодо цих Умов використання,
            будь ласка, зв'яжіться з нами за електронною адресою{' '}
            <a className={scss.mailTo} href="mailto:petro.brodetskyi@gmail.com">
              petro.brodetskyi@gmail.com
            </a>
            .
          </p>
        </li>
      </ul>
    </div>
  );
};

export default TermsOfService;
